#Приветствие 1
print("Доброго времени суток")
s1 = input("Как я могу к вам обращаться? Напишите своё имя: ") # переменная типа string
s2 = "Здравствуйте, " + s1
print(s2)
##########################
#Моё предложение 1 (по распечатке фотографий)
print("У меня к вам предложение")
print("У нас вы можете заказать фотопечать")
s1 = input("Если вас заинтересовало моё предложение, то поставьте +:  ")  # переменная типа string
# Калькулятор 1. Cтоимость печати фото 10х15=65 копеек
print('Калькулятор 1.')
print('Стоимость печати фотографий (10х15) - 65 копеек')
а = int
a = int(input('Введите количество фотографий 10х15, которые хотите распечатать: '))
f = a * 0.65
print(f)
#Выбираем бумагу для печатати фотографий: 1-глянцевая или 2-матовая')
print('Бумага для печатати фотографий: 1-глянцевая или 2-матовая?')
a = int(input('Введите цифру,которая соответствует выбранной для печати фотобумаге 1-глянцевая,2-матовая: '))
if a == 1:
    print("Вы выбрали глянцевую фотобумагу")
elif a == 2:
    print('Вы выбрали матовую фотобумагу')
else:
    print('Нет соответствий')
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print("Заказ завершён. Спасибо за заказ")
print("Фото высылайте на почту zoomprolygina@mail.ru или можете сбрасывать их прямо сюда, в телеграмм")
###############################
# Калькулятор 2. Cтоимость печати фото 13х18 или 15х20 будет=1руб 40 копеек
print('Калькулятор 2.')
print('Стоимость печати фотографий  (13х18 или 15х20=1руб40 копеек')
а = int
a = int(input('Введите количество фотографий 13х18 или 15х20, которые хотите распечатать: '))
o = a * 1.40
print(o)
# Выбираем бумагу для печатати фотографий: 1-глянцевая или 2-матовая')
print('Бумага для печатати фотографий: 1-глянцевая или 2-матовая?')
a = int(input('Введите цифру,которая соответствует выбранной для печати фотобумаге 1-глянцевая,2-матовая: '))
if a == 1:
    print("Вы выбрали глянцевую фотобумагу")
elif a == 2:
    print('Вы выбрали матовую фотобумагу')
else:
    print('Нет соответствий')
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print("Заказ завершён. Спасибо за заказ")
print("Фотографии высылайте на почту zoomprolygina@mail.ru или можете сбрасывать их прямо сюда, в телеграмм")
#################################
# Калькулятор 3. Cтоимость печати фото 20х30 будет=2руб 70 копеек
print('Калькулятор 3.')
print('Стоимость печати фотографий  (20х30 будет=2руб 70 копеек')
а = int
a = int(input('Введите количество фотографий 20х30, которые хотите распечатать: '))
t = a * 2.70
print(t)
# # Выбираем бумагу для печатати фотографий: 1-глянцевая или 2-матовая')
print('Бумага для печатати фотографий: 1-глянцевая или 2-матовая?')
a = int(input('Введите цифру,которая соответствует выбранной для печати фотобумаге 1-глянцевая,2-матовая: '))
if a == 1:
    print("Вы выбрали глянцевую фотобумагу")
elif a == 2:
    print('Вы выбрали матовую фотобумагу')
else:
    print('Нет соответствий')
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print("Фотографии высылайте на почту zoomprolygina@mail.ru или можете сбрасывать их прямо сюда, в телеграмм")

print('Общая сумма заказа по печати фотографий составила:')
x = f + o + t
print(x)
################################
#Приветствие 2. Печать холста
print("Доброго времени суток")
s1 = input("Как я могу к вам обращаться? Напишите своё имя: ") # переменная типа string
s2 = "Здравствуйте, " + s1
print(s2)
#Моё предложение 2. Печать холста
print("У меня к вам предложение")
print("У нас вы можете заказать фотопечать на холсте")
s1 = input("Если вас заинтересовало моё предложение, то поставьте +:  ")  # переменная типа string
#Калькулятор 4. Cтоимость печати на холсте 30смх40см (формат А3)-25руб 00копеек
print('Калькулятор 4.')
print('Cтоимость печати на холсте 30смх40см (формат А3)-25руб 00копеек')
а = int
a = int(input('Введите количество холстов 30смх40см (формат А3)-25руб 00копеек, которые хотите заказать: '))
x = a * 25.00
print(x)
print("Заказ завершён. Спасибо за заказ")
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print("Фотографии высылайте на почту zoomprolygina@mail.ru или можете сбрасывать их прямо сюда, в телеграмм")
# #Калькулятор 5. Cтоимость печати на холсте 40смх60см (формат А2)-44руб 00копеек
print('Калькулятор 5.')
print('Cтоимость печати на холсте 40смх60см (формат А3)-44руб 00копеек')
а = int
a = int(input('Введите количество холстов 40смх60см (формат А2)-44руб 00копеек, которые хотите заказать: '))
y = a * 44.00
print(y)
print("Заказ завершён. Спасибо за заказ")
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print("Фотографии высылайте на почту zoomprolygina@mail.ru или можете сбрасывать их прямо сюда, в телеграмм")
# #Калькулятор 6. Cтоимость печати на холсте 50смх70см -60руб 00копеек
print('Калькулятор 6.')
print('Cтоимость печати на холсте 60смх70см -60руб 00копеек')
а = int
a = int(input('Введите количество холстов 40смх60см (формат А2)-44руб 00копеек, которые хотите заказать: '))
z = a * 60.00
print(z)
print("Заказ завершён. Спасибо за заказ")
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print("Фотографии высылайте на почту zoomprolygina@mail.ru или можете сбрасывать их прямо сюда, в телеграмм")
print('Общая сумма заказа по печати холстов составила:')
xolst = x + y + z
print(xolst)
#################################
#Приветствие 3. Печать на кружках
print("Доброго времени суток")
s1 = input("Как я могу к вам обращаться? Напишите своё имя: ") # переменная типа string
s2 = "Здравствуйте, " + s1
print(s2)
#Моё предложение 3. Печать на кружках
print("У меня к вам предложение")
print("У нас вы можете заказать печать на кружках")
s1 = input("Если вас заинтересовало моё предложение, то поставьте +:  ")  # переменная типа string
#Калькулятор 7. Cтоимость печати на кружках -14руб 00копеек
print('Калькулятор 6.')
print('Cтоимость печати на кружках -14руб 00копеек')
а = int
a = int(input('Введите количество кружек-14руб 00копеек, которые хотите заказать: '))
k = a * 14.00
print(k)
print("Заказ завершён. Спасибо за заказ")
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print("Фото высылайте на почту zoomprolygina@mail.ru или можете сбрасывать их прямо сюда, в телеграмм")
#############################
#Приветствие 4. Фото на документы=9руб 00копеек 4 фото 4х5 (паспорт)
print("Доброго времени суток")
s1 = input("Как я могу к вам обращаться? Напишите своё имя: ") # переменная типа string
s2 = "Здравствуйте, " + s1
print(s2)
#Моё предложение 3. Фото на документы=9руб 00копеек 4 фото 4х5 (паспорт)
print("У меня к вам предложение")
print("У нас вы можете заказать Фото на документы")
s1 = input("Если вас заинтересовало моё предложение, то поставьте +:  ")  # переменная типа string
#Калькулятор 8. Cтоимость Фото на документы=9руб 00копеек 4 фото 4х5 (паспорт)
print('Калькулятор 6.')
print('Cтоимость Фото на документы=9руб 00копеек -комплект из 4 фото 4х5 (паспорт)')
а = int
a = int(input('Введите количество экземпляров (1экземпляр=9руб 00копеек это 4 фото 4х5 (паспорт)), которые хотите заказать: '))
do= a * 9.00
print(do)
print("Заказ завершён. Спасибо за заказ")
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
#Калькулятор 9. Cтоимость Фото на документы=6руб 00копеек -комплект из 2 фото 3х4
print('Калькулятор 6.')
print('Cтоимость Фото на документы=6руб 00копеек  -комплект из 2 фото 3х4')
а = int
a = int(input('Введите количество экземпляров (1экземпляр=6руб 00копеек это 2 фото 3х4), которые хотите заказать: '))
k = a * 6.00
print(k)
print("Заказ завершён. Спасибо за заказ")
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print('Общая сумма заказа по Фото на документы составила:')
dok = do + k
print(dok)
####################################
#Приветствие 5. Фоторамки
print("Фоторамки 10x15")
print('Минимальная стоимость Фоторамок 10х15=3руб 20копеек')
print('Калькулятор 10.')
print('Рассчитаем Минимальную стоимость Фоторамок')
а = int
a = int(input('Введите количество Фоторамок 10х15, которые хотите заказать: '))
foto = a * 3.20
print(foto)
#
print("Фоторамки 15x21")
print('Минимальная стоимость Фоторамок 15х21=4руб 50копеек')
print('Калькулятор 11.')
print('Рассчитаем Минимальную стоимость Фоторамок 15х21')
а = int
a = int(input('Введите количество Фоторамок, которые хотите заказать: '))
ram = a * 4.50
print(ram)
#
print("Фоторамки 21x30")
print('Минимальная стоимость Фоторамок 21х30=6руб 60копеек')
print('Калькулятор 12.')
print('Рассчитаем Минимальную стоимость Фоторамок 21х30')
а = int
a = int(input('Введите количество Фоторамок, которые хотите заказать: '))
ki = a * 6.60
print(ki)
#
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print('Общая сумма заказа по Фоторамкам составила:')
fotoramki = foto+ ram + ki
print(fotoramki)
print("Заказ завершён. Спасибо за заказ")
#############################
#Приветствие 6. Фотоальбомы
print("Фотоальбомы 10x15")
print('Минимальная стоимость Фотоальбомов 10х15=3руб 20копеек')
print('Калькулятор 13.')
print('Рассчитаем Минимальную стоимость Фотоальбомов')
а = int
a = int(input('Введите количество Фотоальбомов 10х15, которые хотите заказать: '))
foto = a * 3.20
print(foto)
#
print("Фотоальбомы 15x21")
print('Минимальная стоимость Фотоальбомов 15х21=15руб 00копеек')
print('Калькулятор 14.')
print('Рассчитаем Минимальную Фотоальбомов 15х21')
а = int
a = int(input('Введите количество Фотоальбомов, которые хотите заказать: '))
alb = a * 15.00
print(alb)
#
print("Фотоальбомы 23x28")
print('Минимальная стоимость Фотоальбомов 23х28=25руб 00копеек')
print('Калькулятор 15.')
print('Рассчитаем Минимальную стоимость Фотоальбомов 23х28')
а = int
a = int(input('Введите количество Фотоальбомов, которые хотите заказать: '))
omy = a * 25.00
print(omy)
#
import random
n = random.randint(100, 900)
print(n)
print("Номер вашего заказа")
print('Общая сумма заказа по Фотоальбомам составила:')
fotoalbomy = foto+ alb + omy
print(fotoalbomy)
print("Заказ завершён. Спасибо за заказ")
##################################################
#Создаём базу данных наших заказов и заказчиков 1
import sqlite3

# Создаём Базу данных
conn = sqlite3.connect('name_zakaz.db')
# Создаем объект cursor, который позволяет нам взаимодействовать с базой данных и добавлять записи
cursor = conn.cursor()
# Создадим таблицу с двумя текстовыми колонками
cursor.execute('''CREATE TABLE IF NOT EXISTS tab_1(id INTEGER PRIMARY KEY AUTOINCREMENT, col_1 TEXT,col_2 TEXT) ''')

# Заполняем таблицу данными
cursor.execute('''INSERT INTO tab_1(col_1,col_2) VALUES ('nomer zakaza','imya')''')
# Сохраняем изменения
conn.commit()

d = "kolichestvo"
f = "ctoimoct"
cursor.execute('''CREATE TABLE IF NOT EXISTS tab_1(id INTEGER PRIMARY KEY AUTOINCREMENT, col_1 TEXT,col_2 TEXT) ''')
cursor.execute('''INSERT INTO tab_1(col_1,col_2) VALUES (?,?)''', (d, f))
conn.commit()

cursor.execute('''SELECT*FROM tab_1''')
k = cursor.fetchall()
print(k)





